README.md
```mermaid
graph LR
  subgraph To Mail
    direction LR
    PT(Polling Trigger) --> SC1(Service Collection)
    SC1 --> MP(Mail Producer)
  end
  MP --> MS[Mail Server]
  MS --> MC("Mail Consumer")
  subgraph Mail To FS
    direction LR
    MC --> SC2(Service Collection)
    SC2 --> FP(FS Producer)
  end
  FP --> FS(FS)
```
